-- Data for bracelet_wear_logs (12 rows)
INSERT INTO `bracelet_wear_logs` (`id`, `userId`, `wearDate`, `braceletId`, `braceletName`, `hand`, `dayStem`, `tenGod`, `scratchLogId`, `createdAt`) VALUES
(30001, 1, '2026-02-22', 'HS-A', '多彩虎眼石手串', 'left', '己', '傷官', NULL, '"2026-02-22T15:40:09.000Z"'),
(30002, 1, '2026-02-22', 'HS-F', '白硨磲手串', 'right', '己', '傷官', NULL, '"2026-02-22T15:40:11.000Z"'),
(60001, 1, '2026-02-23', 'HS-D', '經典黃虎眼石手串', 'right', '戊', '偏財', NULL, '"2026-02-23T09:11:40.000Z"'),
(60002, 1, '2026-02-23', 'HS-E', '太赫茲能量手串', 'left', '戊', '偏財', NULL, '"2026-02-23T09:11:42.000Z"'),
(90002, 1, '2026-02-24', 'HS-F', '白硨磲手串', 'right', '戊', '正財', NULL, '"2026-02-24T05:04:56.000Z"'),
(90003, 1, '2026-02-24', 'HS-A', '多彩虎眼石手串', 'left', '戊', '正財', NULL, '"2026-02-24T05:04:59.000Z"'),
(120001, 3330308, '2026-02-27', 'HS-H', '沉香木手串', 'left', NULL, NULL, NULL, '"2026-02-26T22:35:06.000Z"'),
(120002, 3330308, '2026-02-27', 'HS-C', '酒紅石榴石手串', 'right', NULL, NULL, NULL, '"2026-02-26T22:35:16.000Z"'),
(150001, 1, '2026-03-04', 'HS-A', '多彩虎眼石手串', 'left', NULL, NULL, NULL, '"2026-03-04T12:57:28.000Z"'),
(150002, 1, '2026-03-04', 'HS-F', '白硨磲手串', 'right', NULL, NULL, NULL, '"2026-03-04T12:57:29.000Z"'),
(210001, 1, '2026-03-10', 'HS-B', '紫晶智慧招財手串', 'left', NULL, NULL, NULL, '"2026-03-10T04:15:01.000Z"'),
(210002, 1, '2026-03-10', 'HS-D', '經典黃虎眼石手串', 'right', NULL, NULL, NULL, '"2026-03-10T04:15:13.000Z"');
