-- Data for custom_bracelets (11 rows)
INSERT INTO `custom_bracelets` (`id`, `code`, `name`, `element`, `color`, `functionDesc`, `tacticalRoles`, `enabled`, `sortOrder`, `isBuiltin`, `createdAt`, `updatedAt`, `pairingItems`) VALUES
(1, 'HS-A', '多彩虎眼石手串', '土', '黃/藍', '現實穩定器', '{"補土":"財富鎖定器","補金":"決斷力放大器","default":"能量平衡器"}', 1, 0, 1, '"2026-02-26T22:02:57.000Z"', '"2026-02-26T22:02:57.000Z"', NULL),
(2, 'HS-B', '紫晶智慧招財手串', '火', '紫/黃/紅/綠', '才華引爆器', '{"補火":"創意太陽","補土":"財富磁場","default":"智慧共振器"}', 1, 1, 1, '"2026-02-26T22:02:57.000Z"', '"2026-02-26T22:02:57.000Z"', NULL),
(3, 'HS-C', '酒紅石榴石手串', '火', '酒紅', '能量引爆器', '{"補火":"創意的太陽","強火":"才華巔峰器","default":"火元素放大器"}', 1, 2, 1, '"2026-02-26T22:02:57.000Z"', '"2026-02-26T22:02:57.000Z"', NULL),
(4, 'HS-D', '經典黃虎眼石手串', '土', '黃色', '現實穩定器', '{"補土":"成果鎖定器","補金":"決斷力基石","default":"土元素穩定器"}', 1, 3, 1, '"2026-02-26T22:02:57.000Z"', '"2026-02-26T22:02:57.000Z"', NULL),
(5, 'HS-E', '太赫茲能量手串', '金', '銀灰', '權威放大器', '{"補金":"權威權杖","制木":"決斷力劍","default":"金元素放大器"}', 1, 4, 1, '"2026-02-26T22:02:57.000Z"', '"2026-02-26T22:02:57.000Z"', NULL),
(6, 'HS-F', '白硨磲手串', '金', '白色', '淨化護盾', '{"補金":"純淨護盾","制木":"清明決策盾","default":"金水平衡器"}', 1, 5, 1, '"2026-02-26T22:02:57.000Z"', '"2026-02-26T22:02:57.000Z"', NULL),
(7, 'HS-G', '金太陽石手串', '火', '金橙', '財運引爆器', '{"補火":"財運太陽","補土":"黃金磁場","default":"火土共振器"}', 1, 6, 1, '"2026-02-26T22:02:57.000Z"', '"2026-02-26T22:02:57.000Z"', NULL),
(8, 'HS-H', '沉香木手串', '木', '棕/黑', '生命能量包', '{"補木":"生命根基","default":"木元素共鳴器"}', 1, 7, 1, '"2026-02-26T22:02:57.000Z"', '"2026-02-26T22:02:57.000Z"', NULL),
(9, 'HS-I', '天珠瑪瑙手串', '水', '黑/深藍', '理智療癒師', '{"補水":"理智守護者","default":"水元素療癒器"}', 1, 8, 1, '"2026-02-26T22:02:58.000Z"', '"2026-02-26T22:02:58.000Z"', NULL),
(10, 'HS-J', '和田玉竹節手串', '土', '白/黑', '財富根基', '{"補土":"財富根基石","補金":"玉石護法","default":"土金平衡器"}', 1, 9, 1, '"2026-02-26T22:02:58.000Z"', '"2026-02-26T22:02:58.000Z"', NULL),
(30001, 'Se-01', '棕黃色虎眼石手串', '土', '棕黃色', '這條虎眼石手串主要呈現棕黃色調，在五行中屬於「土」的能量。土代表穩定、踏實、滋養與包容。佩戴這類顏色的手串，可以幫助你增加 grounded 的感覺，提升安全感，讓思緒更清晰，也比較容易累積財富喔！虎眼石本身也有避邪、招財的寓意，是個很不錯的選擇。', '{}', 1, 1, 0, '"2026-03-03T05:14:48.000Z"', '"2026-03-03T05:14:48.000Z"', NULL);
