-- Data for plans (5 rows)
INSERT INTO `plans` (`id`, `name`, `price`, `level`, `description`, `createdAt`, `isActive`, `updatedAt`, `bonusPoints`, `firstSubscriptionBonusCoins`, `monthlyRenewalBonusCoins`) VALUES
('2026_TEST1', '2026 體驗方案', '0.00', 1, '不定時取消', '"2026-02-26T03:52:14.000Z"', 1, '"2026-03-07T15:47:13.000Z"', 0, 100, 0),
('advanced', '進階方案', '590.00', 2, '月費 599 元，完整命理功能與每日分析', '"2026-02-25T22:22:21.000Z"', 1, '"2026-03-07T15:48:54.000Z"', 600, 500, 350),
('basic', '基礎方案', '0.00', 1, '免費方案，提供基本命格與每日運勢功能', '"2026-02-25T22:22:21.000Z"', 1, '"2026-03-07T15:48:10.000Z"', 0, 0, 100),
('life_299', '生活方案', '390.00', 2, NULL, '"2026-02-27T11:42:38.000Z"', 1, '"2026-03-07T15:48:47.000Z"', 200, 300, 200),
('professional', '專業方案', '990.00', 3, '月費 999 元，深度流年流月分析與 AI 命格解析', '"2026-02-25T22:22:21.000Z"', 1, '"2026-03-07T15:49:07.000Z"', 1000, 1000, 750);
