-- Data for private_messages (9 rows)
INSERT INTO `private_messages` (`id`, `bookingId`, `senderId`, `content`, `imageUrl`, `createdAt`, `isRead`, `readAt`) VALUES
(1, 30003, 1, '📅 新預約請求！希望預約時間：上午04:00 ~ 上午05:00。請老師確認後回覆。', NULL, '"2026-03-07T08:02:09.000Z"', 0, NULL),
(2, 30003, 1, '好的 我馬上確認', NULL, '"2026-03-07T08:27:56.000Z"', 0, NULL),
(3, 30003, 1, '✅ 老師已確認您的預約，請依約定完成付款。', NULL, '"2026-03-07T08:28:11.000Z"', 0, NULL),
(4, 30004, 1, '📅 新預約請求！希望預約時間：上午02:30 ~ 上午04:00。請老師確認後回覆。', NULL, '"2026-03-07T11:32:01.000Z"', 0, NULL),
(5, 30001, 3270013, '老師您好', NULL, '"2026-03-07T16:40:52.000Z"', 1, '"2026-03-07T16:43:01.000Z"'),
(6, 30004, 1, '❌ 老師已取消此預約。如有疑問請透過訊息聯繫。', NULL, '"2026-03-07T23:51:48.000Z"', 0, NULL),
(7, 30003, 1, '❌ 老師已取消此預約。如有疑問請透過訊息聯繫。', NULL, '"2026-03-07T23:51:52.000Z"', 0, NULL),
(8, 30001, 1, '❌ 老師已取消此預約。如有疑問請透過訊息聯繫。', NULL, '"2026-03-07T23:51:58.000Z"', 0, NULL),
(30001, 60001, 1, '📅 新預約請求！希望預約時間：上午05:00 ~ 上午06:00。請老師確認後回覆。', NULL, '"2026-03-12T13:22:00.000Z"', 0, NULL);
