-- Data for scratch_logs (5 rows)
INSERT INTO `scratch_logs` (`id`, `userId`, `denomination`, `storeAddress`, `purchaseHour`, `resonanceScore`, `isWon`, `wonAmount`, `note`, `purchasedAt`, `createdAt`, `fengShuiGrade`, `fengShuiScore`) VALUES
(1, 690036, 500, '10491臺北市中山區八德路二段341號', '未', NULL, 0, 0, NULL, 1771825647741, '"2026-02-23T10:47:28.000Z"', NULL, NULL),
(30001, 1290011, 200, '台北市士林區通河街141巷12號', '未', NULL, 1, 1500, ' 今日最高分：2(23分)、7(22分)、4(17分)，七殺日×未時加權', 1771997423140, '"2026-02-25T10:30:23.000Z"', NULL, NULL),
(60001, 1290011, 300, '台北市士林區通河街141巷12號', '未', NULL, 0, 0, ' 七殺日特定幸運數字：4、9、2、7，買49號', 1772000589078, '"2026-02-25T11:23:09.000Z"', NULL, NULL),
(60002, 1290011, 200, '111臺北市士林區承德路四段40巷30號', '未', NULL, 0, 0, '今日最高分：2(23分)、7(22分)、4(19分)，七殺日×未時加權，買27號', 1772001351101, '"2026-02-25T11:35:51.000Z"', NULL, NULL),
(90001, 690036, 500, '105臺北市松山區南京東路五段123巷5號', '未', NULL, 1, 500, NULL, 1772688961059, '"2026-03-05T10:36:01.000Z"', NULL, NULL);
